EMPLOYMENT_LIST = [
    'стажировка',
    'частичная занятость',
    'полная занятость',
    'волонтерство',
    'проектная работа',
]

SCHEDULE_LIST = [
    'полный день',
    'сменный график ',
    'гибкий график',
    'удаленная работа',
    'вахтовый метод',
]

SKILL_LIST = [
    'Python',
    'MySQL',
    'PostgreSQL',
    'Django Framework',
    'Django Rest Framework',
    'Unix',
    'JavaScript',
    'React',
]

LANGUAGE_LEVEL_LIST = [
    'A1',
    'A2',
    'B1',
    'B2',
    'C1',
    'C2',
]

LANGUAGES_LIST = [
    'Английский',
    'Русский',
    'Китайский',
    'Немецкий',
    'Французский',
    'Испанский',
    'Португальский',
]

CURRENCY_DICT = {
    'RUB': 'Рубли',
    'EUR': 'Евро',
    'USD': 'Доллары',
}

# FOR TESTS

PROFESSIONAL_ROLES = [
    'Python backend developer',
    'JS developer',
    'C# разработчик',
    'Аналитик данных',
    'Java разработчик',
    'Fullstack python dev',
]

ABOUT_ME = [
    'Меня зовут Иван, я закончил высшее образование в области информационных технологий '
    'и имею опыт работы в различных IT-компаниях. Имею навыки в разработке программного обеспечения, '
    'в частности, на языках Python и Java. Также знаком с базами данных, методологиями Agile и Scrum. '
    'Обладаю навыками коммуникации, готов к работе в команде и обучению новым технологиям.',

    'Меня зовут Кирилл, я молодой и амбициозный специалист с опытом работы в области маркетинга. '
    'Имею навыки в составлении стратегий, контент-маркетинга, аналитики и исследования рынка. '
    'Обладаю навыками коммуникации и презентации',

    'Меня зовут Анна, я опытный специалист в области финансового анализа и управления финансами. '
    'Имею степень МВА и знание программ Excel, Bloomberg, и управления рисками. '
    'Обладаю навыками коммуникации и готов к принятию сложных решений.',

    'Меня зовут Петр, я имею большой опыт работы в области HR и управления персоналом. '
    'Имею степень в менеджменте и знание систем автоматизации HR',

    'Меня зовут Екатерина, я имею опыт работы в области продаж и маркетинга. '
    'Имею степень в маркетинге и знание CRM-систем. Обладаю навыками продаж и коммуникации, готова работать в команде',

    'Меня зовут Екатерина, я имею опыт работы в области продаж и маркетинга. '
    'Имею степень в маркетинге и знание CRM-систем. Обладаю навыками продаж и коммуникации, готова работать в команде',
]

DESCRIPTIONS = [
    'Мое прошлое место работы - это крупная международная компания, занимающаяся производством и продажей промышленного'
    'оборудования. ',
    'Мое прошлое место работы - это крупная международная компания, занимающаяся производством и продажей промышленного'
    'оборудования. ',
    'Мое прошлое место работы - это крупная международная компания, занимающаяся производством и продажей промышленного'
    'оборудования. ',
    'Мое прошлое место работы - это крупная международная компания, занимающаяся производством и продажей промышленного'
    'оборудования. ',
    'Мое прошлое место работы - это крупная международная компания, занимающаяся производством и продажей промышленного'
    'оборудования. ',
    'Мое прошлое место работы - это крупная международная компания, занимающаяся производством и продажей промышленного'
    'оборудования. ',
]
